                org 7C00h
start:
; Инициализируем сегменты. Все будут указывать на сегмент кода
                mov             ax,cs
                mov             ds,ax
                mov             es,ax
                mov             ss,ax
				
                xor             sp,sp               ; Обнуляем указатель вершины стека
; Очищаем экран
                mov             ax,3
                int             10h
; Загружаем шрифт
                mov             ax,1110h
                mov             cx,10               ; Число знаков
                mov             dx,160              ; Смещение на символ.
                mov             bx,1000h            ; 16 байт на символ
                mov             bp, font
                int             10h
; Загружаем псевдографику
                mov             ax,1110h
                mov             cx,4                ; Число знаков
                mov             dx,0B0h             ; Смещение на символ. Псевдографика B0-DF
                mov             bx,1000h            ; 16 байт на символ
                mov             bp, graph
                int             10h

; Выводим текст
                push            0b800h              ; Сегмент текстового режима заносим в ES
                pop             es
                mov             di,160*12+(79-34)*2 ; Смещение на позицию на экране Справа/Центр
                mov             si, fio             ; Смещение на выводимую строку
                mov             ah,55               ; Цвет
text_loop:
                lodsb                               ; Загружаем символ в al
                or              al,al               ; Повторяем пока очередной символ не станет равным нулю
                stosw                               ; Отображаем символ на экране
                jnz             text_loop
; Выводим треугольник
                mov             di,160*12           ; Смещение на позицию на экране
                mov             si, ellipce         ; Смещение на выводимую строку
                mov             cx,4                ; Число символов
                mov             ah,15
graph_loop:
                lodsb                               ; Загружаем символ в al
                stosw                               ; Отображаем символ на экране
                loop            graph_loop          ; Цикл
                xor             ax,ax               ; Ожидаем нажатия клавиши
                int             16h

; Здесь должна начать работу операционная система...          
; Усков Даниил Евгеньевич НМТ-393907
fio             db              169 ; "У"
                db              "c"
                db              163 ; "к"
                db              "o"
                db              160 ; "в"
                db              " "
                db              168 ; "Д"
                db              "a"
                db              165 ; "н"
                db              162 ; "и"
                db              162 ; "и"
                db              164 ; "л"
                db              " "
                db              "E"
                db              160 ; "в"
                db              161 ; "г"
                db              "e"
                db              165 ; "н"
                db              167 ; "ь"
                db              "e"
                db              160 ; "в"
                db              162 ; "и"
                db              166 ; "ч"
                db              " HMT-393907"
                db              0
ellipce db             0b0h,0b1h,0b2h,0b3h
font:
rus_v   db 000,000,000,000,000,252,102,102,124,102,102,252,000,000,000,000 ; 160
rus_g   db 000,000,000,000,000,126,050,050,048,048,048,120,000,000,000,000 ; 161
rus_i   db 000,000,000,000,000,198,198,206,214,230,198,198,000,000,000,000 ; 162
rus_k   db 000,000,000,000,000,230,108,120,120,108,102,230,000,000,000,000 ; 163
rus_l   db 000,000,000,000,000,030,054,102,102,102,102,102,000,000,000,000 ; 164
rus_n   db 000,000,000,000,000,198,198,198,254,198,198,198,000,000,000,000 ; 165
rus_ch  db 000,000,000,000,000,198,198,198,198,126,006,006,000,000,000,000 ; 166
rus_ss  db 000,000,000,000,000,198,198,198,246,222,222,246,000,000,000,000 ; 167
rus_D	db 000,000,030,054,102,102,102,102,102,102,102,255,195,129,000,000 ; 168
rus_U	db 000,000,198,198,198,198,198,126,006,006,198,124,000,000,000,000 ; 169

graph:
                db              00000000b       ; B0 - здесь начинается псевдографика
                db              00000000b
                db              00000001b
                db              00000110b
                db              00001000b
                db              00010000b
                db              00010000b
                db              00010000b
                db              00010000b
                db              00010000b
                db              00001000b
                db              00000110b
                db              00000001b
                db              00000000b
                db              00000000b
                db              00000000b

                db              00000000b
                db              01111111b
                db              10000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              10000000b
                db              01111111b
                db              00000000b
                db              00000000b

                db              00000000b
                db              11111110b
                db              00000001b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              00000001b
                db              11111110b
                db              00000000b
                db              00000000b

                db              00000000b
                db              00000000b
                db              10000000b
                db              01100000b
                db              00010000b
                db              00001000b
                db              00001000b
                db              00001000b
                db              00001000b
                db              00001000b
                db              00010000b
                db              01100000b
                db              10000000b
                db              00000000b
                db              00000000b
                db              00000000b
                db              510-($-$$) dup 0 ; Нули для заполнения остатков до конца сектора
                
                dw              0AA55h  ; Признак загрузочного сектора
